[
  {
    "name": "Maria G.",
    "date": "2024",
    "review": "Mr. Vasquez and his team helped me get my green card. They were professional, caring, and always available to answer my questions.",
    "rating": 5,
    "location": "Raleigh"
  },
  {
    "name": "John D.",
    "date": "2024",
    "review": "After my car accident, Vasquez Law Firm fought for me and got me the compensation I deserved. Highly recommend!",
    "rating": 5,
    "location": "Charlotte"
  },
  {
    "name": "Brandi T.",
    "date": "Dec 19, 2023",
    "review": "The help was fast and efficient. Definitely recommend and would use them again. They knew exactly how to help us.",
    "rating": 5,
    "location": "Smithfield"
  },
  {
    "name": "C H",
    "date": "Aug 01, 2023",
    "review": "I have nothing but great things to say about this law firm. William Vasquez and Sara Fugon handled my immigration case. I started my green card process 5 years ago with them. I have a misdemeanor on my record so I knew it would be a challenge when applying for this permanent status. Not only did immigration grant me my waiver with no issues but the paperwork Vasquez law did for me to take overseas to the US embassy was so organized, it made it that much easier in my interview with the officer. I was not even out of the country for two weeks. I got approved as of last week and I am now back with my family. After dreaming of becoming a permanent resident. Vasquez law has made that dream a reality. Thank you guys.",
    "rating": 5,
    "location": "Durham"
  },
  {
    "name": "Sarah Thompson",
    "date": "Mar 2024",
    "review": "Outstanding legal representation! They handled my personal injury case with professionalism and got me a great settlement. The team was always available to answer questions.",
    "rating": 5,
    "location": "Winston-Salem"
  },
  {
    "name": "Michael Johnson",
    "date": "Feb 2024",
    "review": "Vasquez Law Firm helped me through a difficult criminal defense case. Their expertise and dedication made all the difference. I highly recommend them to anyone needing legal help.",
    "rating": 5,
    "location": "Orlando"
  },
  {
    "name": "Jennifer Martinez",
    "date": "Jan 2024",
    "review": "The best immigration lawyers in North Carolina! They helped my entire family with our citizenship process. Professional, knowledgeable, and truly caring about their clients.",
    "rating": 5,
    "location": "Raleigh"
  },
  {
    "name": "Robert Williams",
    "date": "Dec 2023",
    "review": "After my workplace injury, I didn't know where to turn. Vasquez Law Firm guided me through the workers' compensation process and ensured I got the benefits I deserved.",
    "rating": 5,
    "location": "Charlotte"
  },
  {
    "name": "Lisa Anderson",
    "date": "Nov 2023",
    "review": "Excellent traffic violation defense! They helped reduce my charges and saved my driving record. Very professional and responsive throughout the entire process.",
    "rating": 5,
    "location": "Durham"
  },
  {
    "name": "David Garcia",
    "date": "Oct 2023",
    "review": "I can't thank Vasquez Law Firm enough for their help with my family's immigration case. They made a complex process simple and were with us every step of the way.",
    "rating": 5,
    "location": "Smithfield"
  },
  {
    "name": "Patricia Brown",
    "date": "Sep 2023",
    "review": "Professional, compassionate, and effective. They handled my personal injury case with care and got me the compensation I needed to move forward with my life.",
    "rating": 5,
    "location": "Winston-Salem"
  },
  {
    "name": "James Wilson",
    "date": "Aug 2023",
    "review": "The team at Vasquez Law Firm is exceptional. They helped me navigate a complicated legal situation and achieved a better outcome than I expected. Highly recommended!",
    "rating": 5,
    "location": "Orlando"
  }
]
